package com.glaf.base.modules.others;

public class OthersConstants {
	public static int REFER_TYPE[]={
		0,	//特采申请－新增
		1,	//特采申请－变更
		2,	//特采申请－废止
		3,	//决裁书
		4,	//订单－变更
		5,	//订单－废止
		6,	//合同申请－新增
		7,	//合同申请－解除
		8,	//合同申请－终止
		9,	//合同申请－补签协议
		10,	//验收申请
		11,	//供应商申请
		12,	//供应商变更
		13,	//供应商废止
		14,	//重财申请
		15, //报价文件
		16, //技术规格书
		17, //供应商外网
		18, //供应商升级
		19, //付款通知书的发票的附件
		20, //决策评价表进度要求
		21, //决策评价表用途说明
		22, //决策评价表技术原因
		23, //决策评价表配套情况
		24,	//决裁书会议记录
		25, //询价单
		26, //询价单发送报价书模板
		27, //供应商变更、升级、废止时的附件（非《供应商全名变更申请书》）
		28, //式样规格附件
		29, //特采单验收日期变更
		30, //合同验收日期变更
		31, //单一供应商决策表
		32,  //决裁大于100万生效文件
		33,  //合同模板附件
		34, //特采申请－退单重提
		35, //式样规格附件(历史)
		36,//物品管理
		37, //合同呈批--供应商意见回复附件
		38, //推荐供应商时的附件（非《新规供应商编码申请书》）
		39, //营业执照
		40, //税务登记
		41, //经营许可证
		42, //银行信用等级
		43, //品牌代理证书
		44, //安全生产证书
		45,  //财务信息
		46,  //开始使用审批
		47	 //其它投资支付
	};
}
