	/* ============================================================
	 * 描述：字符串数组对象
	 * 参数：value - 字符串类型
	 * ============================================================
	 */
	function StrBuffer(value)
	{
		this.temp = [];
		if(value)this.append(value);
	}
	
	StrBuffer.prototype = {
		
		/* ============================================================
		 * 描述：在原数组增加一元素
		 * 参数：value - 字符串类型
		 * 返回：数组的索引值
		 * ============================================================
		 */
		append : function(value)
		{
			this.temp.push(value);
			return this.temp.length -1;
		},
		
		/* ============================================================
		 * 描述：编辑某元素中的值
		 * 参数：index - 指定数组的索引值
		 * 		value - 字符串类型
		 * ============================================================
		 */
		edit : function(index, value) {
			if(this.temp[index]) {
				this.temp[index] = value;
			}
		},
		
		/* ============================================================
		 * 描述：格式化数组，以字符串输出
		 * ============================================================
		 */
		toString : function()
		{
			return this.temp.join('');
		}
	};