/*
================================================================================
项目名称 ：   基盘
文件名称 ：   config.js                                 
描    述 ：   配置文件 
================================================================================================
修改履历                                                                								标识        
年 月 日		区分			所 属/担 当           内 容									标识        
----------   ----   -------------------- ---------------                          ------        
2009/4/28   	编写   		Intasect/李闻海     新規作成                                                                            
================================================================================
*/
var langList = 
[
	{name:'en',		charset:'UTF-8'},
	{name:'zh-cn',	charset:'gb2312'},
	{name:'zh-tw',	charset:'GBK'}
];

var skinList = 
[
	{name:'default',	charset:'gb2312'},
	{name:'whyGreen',	charset:'gb2312'}
];